TheLancashireman/rp2040-bare-metal/test/compile-test/header-test.c
	nfail += test_address(&rp2040_pio0.irqf,			0x50200030, "rp2040_pio0.irqf");
	nfail += test_address(&rp2040_pio0.irq_force,		0x50200034, "rp2040_pio0.irq_force");
	nfail += test_address(&rp2040_pio0.ip_syn_byp,		0x50200038, "rp2040_pio0.ip_syn_byp");
	nfail += test_address(&rp2040_pio0.dbg_padout,		0x5020003c, "rp2040_pio0.dbg_padout");
	nfail += test_address(&rp2040_pio0.dbg_padoe,		0x50200040, "rp2040_pio0.dbg_padoe");
	nfail += test_address(&rp2040_pio0.dbg_cfginfo,		0x50200044, "rp2040_pio0.dbg_cfginfo");

	nfail += test_address(&rp2040_pio0.instr_mem[0],	0x50200048, "rp2040_pio0.instr_mem[0]");
	nfail += test_address(&rp2040_pio0.instr_mem[1],	0x5020004c, "rp2040_pio0.instr_mem[1]");

	nfail += test_address(&rp2040_pio0.sm[0].clkdiv,	0x502000c8, "rp2040_pio0.sm0_clkdiv");
	nfail += test_address(&rp2040_pio0.sm[0].execctrl,	0x502000cc, "rp2040_pio0.sm0_execctrl");
	nfail += test_address(&rp2040_pio0.sm[0].shiftctrl,	0x502000d0, "rp2040_pio0.sm0_shiftctrl");
	nfail += test_address(&rp2040_pio0.sm[0].addr,		0x502000d4, "rp2040_pio0.sm0_addr");
	nfail += test_address(&rp2040_pio0.sm[0].instr,		0x502000d8, "rp2040_pio0.sm0_instr");
	nfail += test_address(&rp2040_pio0.sm[0].pinctrl,	0x502000dc, "rp2040_pio0.sm0_pinctrl");

	nfail += test_address(&rp2040_pio0.sm[1].clkdiv,	0x502000e0, "rp2040_pio0.sm1_clkdiv");

	nfail += test_address(&rp2040_pio0.intr,			0x50200128, "rp2040_pio0.intr");

	nfail += test_address(&rp2040_pio0.irq[0].inte,		0x5020012c, "rp2040_pio0.irq0_inte");
	nfail += test_address(&rp2040_pio0.irq[0].intf,		0x50200130, "rp2040_pio0.irq0_intf");
	nfail += test_address(&rp2040_pio0.irq[0].ints,		0x50200134, "rp2040_pio0.irq0_ints");
	nfail += test_address(&rp2040_pio0.irq[1].inte,		0x50200138, "rp2040_pio0.irq1_inte");

	/* It's sufficient to test the first register of pio1 to make sure the base address is correct.
	 * All the rest of the registers in pio1 can be inferred.
	*/
	nfail += test_address(&rp2040_pio1.ctrl,			0x50300000, "rp2040_pio1.ctrl");
	return nfail;
}

static int test_resets(void)
{
	int nfail = 0;
	nfail += test_address(&rp2040_resets.reset,			0x4000c000, "rp2040_resets.reset");
	nfail += test_address(&rp2040_resets.wdsel,			0x4000c004, "rp2040_resets.wdsel");
	nfail += test_address(&rp2040_resets.done,			0x4000c008, "rp2040_resets.done");
	return nfail;
}

static int test_sio(void)
{
	int nfail = 0;
	nfail += test_address(&rp2040_sio.cpuid,				0xd0000000, "rp2040_sio.cpuid");
	nfail += test_address(&rp2040_sio.gpio_in,				0xd0000004, "rp2040_sio.gpio_in");
	nfail += test_address(&rp2040_sio.gpio_hi_in,			0xd0000008, "rp2040_sio.gpio_hi_in");

	nfail += test_address(&rp2040_sio.gpio_out.val,			0xd0000010, "rp2040_sio.gpio_out");
	nfail += test_address(&rp2040_sio.gpio_out.w1s,			0xd0000014, "rp2040_sio.gpio_out_set");
	nfail += test_address(&rp2040_sio.gpio_out.w1c,			0xd0000018, "rp2040_sio.gpio_out_clr");
	nfail += test_address(&rp2040_sio.gpio_out.xor,			0xd000001c, "rp2040_sio.gpio_out_xor");

	/* No need to test the atomic access ports for gpio_oe, gpio_hi_out and gpio_hi_oe.
	*/
	nfail += test_address(&rp2040_sio.gpio_oe.val,			0xd0000020, "rp2040_sio.gpio_oe");
	nfail += test_address(&rp2040_sio.gpio_hi_out.val,		0xd0000030, "rp2040_sio.gpio_hi_out");
	nfail += test_address(&rp2040_sio.gpio_hi_oe.val,		0xd0000040, "rp2040_sio.gpio_hi_oe");

	nfail += test_address(&rp2040_sio.fifo_st,				0xd0000050, "rp2040_sio.fifo_st");
	nfail += test_address(&rp2040_sio.fifo_wr,				0xd0000054, "rp2040_sio.fifo_wr");
	nfail += test_address(&rp2040_sio.fifo_rd,				0xd0000058, "rp2040_sio.fifo_rd");
	nfail += test_address(&rp2040_sio.spinlock_st,			0xd000005c, "rp2040_sio.spinlock_st");
	nfail += test_address(&rp2040_sio.div_udividend,		0xd0000060, "rp2040_sio.div_udividend");
	nfail += test_address(&rp2040_sio.div_udivisor,			0xd0000064, "rp2040_sio.div_udivisor");
	nfail += test_address(&rp2040_sio.div_sdividend,		0xd0000068, "rp2040_sio.div_sdividend");
	nfail += test_address(&rp2040_sio.div_sdivisor,			0xd000006c, "rp2040_sio.div_sdivisor");
	nfail += test_address(&rp2040_sio.div_quotient,			0xd0000070, "rp2040_sio.div_quotient");
	nfail += test_address(&rp2040_sio.div_remainder,		0xd0000074, "rp2040_sio.div_remainder");
	nfail += test_address(&rp2040_sio.div_csr,				0xd0000078, "rp2040_sio.div_csr");
	nfail += test_address(&rp2040_sio.interp[0].accum0,		0xd0000080, "rp2040_sio.interp[0].accum0");
	nfail += test_address(&rp2040_sio.interp[0].accum1,		0xd0000084, "rp2040_sio.interp[0].accum1");
	nfail += test_address(&rp2040_sio.interp[0].base0,		0xd0000088, "rp2040_sio.interp[0].base0");
	nfail += test_address(&rp2040_sio.interp[0].base1,		0xd000008c, "rp2040_sio.interp[0].base1");
	nfail += test_address(&rp2040_sio.interp[0].base2,		0xd0000090, "rp2040_sio.interp[0].base2");
	nfail += test_address(&rp2040_sio.interp[0].pop_lane0,	0xd0000094, "rp2040_sio.interp[0].pop_lane0");
	nfail += test_address(&rp2040_sio.interp[0].pop_lane1,	0xd0000098, "rp2040_sio.interp[0].pop_lane1");
	nfail += test_address(&rp2040_sio.interp[0].pop_full,	0xd000009c, "rp2040_sio.interp[0].pop_full");
	nfail += test_address(&rp2040_sio.interp[0].peek_lane0,	0xd00000a0, "rp2040_sio.interp[0].peek_lane0");
	nfail += test_address(&rp2040_sio.interp[0].peek_lane1,	0xd00000a4, "rp2040_sio.interp[0].peek_lane1");
	nfail += test_address(&rp2040_sio.interp[0].peek_full,	0xd00000a8, "rp2040_sio.interp[0].peek_full");
	nfail += test_address(&rp2040_sio.interp[0].ctrl_lane0,	0xd00000ac, "rp2040_sio.interp[0].ctrl_lane0");
	nfail += test_address(&rp2040_sio.interp[0].ctrl_lane1,	0xd00000b0, "rp2040_sio.interp[0].ctrl_lane1");
	nfail += test_address(&rp2040_sio.interp[0].accum0_add,	0xd00000b4, "rp2040_sio.interp[0].accum0_add");
	nfail += test_address(&rp2040_sio.interp[0].accum1_add,	0xd00000b8, "rp2040_sio.interp[0].accum1_add");
	nfail += test_address(&rp2040_sio.interp[0].base_1and0,	0xd00000bc, "rp2040_sio.interp[0].base_1and0");

	/* No need to test the all the registers in interp1.
	*/
	nfail += test_address(&rp2040_sio.interp[1].accum0,		0xd00000c0, "rp2040_sio.interp[1].accum0");

	nfail += test_address(&rp2040_sio.spinlock[0],			0xd0000100, "rp2040_sio.spinlock[0]");
	nfail += test_address(&rp2040_sio.spinlock[1],			0xd0000104, "rp2040_sio.spinlock[1]");
	nfail += test_address(&rp2040_sio.spinlock[31],			0xd000017c, "rp2040_sio.spinlock[31]");
	return nfail;
}

