TheLancashireman/rp2040-bare-metal/test/compile-test/header-test.c
static int test_clocks(void)
{
	int nfail = 0;
	nfail += test_address(&rp2040_clocks.gpout[0].ctrl,		0x40008000, "rp2040_clocks.gpout[0].ctrl");
	nfail += test_address(&rp2040_clocks.gpout[0].div,		0x40008004, "rp2040_clocks.gpout[0].div");
	nfail += test_address(&rp2040_clocks.gpout[0].selected,	0x40008008, "rp2040_clocks.gpout[0].selected");
	nfail += test_address(&rp2040_clocks.gpout[1].ctrl,		0x4000800c, "rp2040_clocks.gpout[1].ctrl");
	nfail += test_address(&rp2040_clocks.ref.ctrl,			0x40008030, "rp2040_clocks.ref.ctrl");
	nfail += test_address(&rp2040_clocks.sys.ctrl,			0x4000803c, "rp2040_clocks.sys.ctrl");
	nfail += test_address(&rp2040_clocks.peri.ctrl,			0x40008048, "rp2040_clocks.peri.ctrl");
	nfail += test_address(&rp2040_clocks.usb.ctrl,			0x40008054, "rp2040_clocks.usb.ctrl");
	nfail += test_address(&rp2040_clocks.adc.ctrl,			0x40008060, "rp2040_clocks.adc.ctrl");
	nfail += test_address(&rp2040_clocks.rtc.ctrl,			0x4000806c, "rp2040_clocks.rtc.ctrl");
	nfail += test_address(&rp2040_clocks.sys_resus_ctrl,	0x40008078, "rp2040_clocks.sys_resus_ctrl");
	nfail += test_address(&rp2040_clocks.sys_resus_status,	0x4000807c, "rp2040_clocks.sys_resus_status");
	nfail += test_address(&rp2040_clocks.fc0_ref_khz,		0x40008080, "rp2040_clocks.fc0_ref_khz");
	nfail += test_address(&rp2040_clocks.fc0_min_khz,		0x40008084, "rp2040_clocks.fc0_min_khz");
	nfail += test_address(&rp2040_clocks.fc0_max_khz,		0x40008088, "rp2040_clocks.fc0_max_khz");
	nfail += test_address(&rp2040_clocks.fc0_delay,			0x4000808c, "rp2040_clocks.fc0_delay");
	nfail += test_address(&rp2040_clocks.fc0_interval,		0x40008090, "rp2040_clocks.fc0_interval");
	nfail += test_address(&rp2040_clocks.fc0_src,			0x40008094, "rp2040_clocks.fc0_src");
	nfail += test_address(&rp2040_clocks.fc0_status,		0x40008098, "rp2040_clocks.fc0_status");
	nfail += test_address(&rp2040_clocks.fc0_result,		0x4000809c, "rp2040_clocks.fc0_result");
	nfail += test_address(&rp2040_clocks.wake_en[0],		0x400080a0, "rp2040_clocks.wake_en[0]");
	nfail += test_address(&rp2040_clocks.wake_en[1],		0x400080a4, "rp2040_clocks.wake_en[1]");
	nfail += test_address(&rp2040_clocks.sleep_en[0],		0x400080a8, "rp2040_clocks.sleep_en[0]");
	nfail += test_address(&rp2040_clocks.sleep_en[1],		0x400080ac, "rp2040_clocks.sleep_en[1]");
	nfail += test_address(&rp2040_clocks.enabled[0],		0x400080b0, "rp2040_clocks.enabled[0]");
	nfail += test_address(&rp2040_clocks.enabled[1],		0x400080b4, "rp2040_clocks.enabled[1]");
	nfail += test_address(&rp2040_clocks.intcs.intr,		0x400080b8, "rp2040_clocks.intcs.intr");
	nfail += test_address(&rp2040_clocks.intcs.inte,		0x400080bc, "rp2040_clocks.intcs.inte");
	nfail += test_address(&rp2040_clocks.intcs.intf,		0x400080c0, "rp2040_clocks.intcs.intf");
	nfail += test_address(&rp2040_clocks.intcs.ints,		0x400080c4, "rp2040_clocks.intcs.ints");

	nfail += test_address(&rp2040_xosc.ctrl,				0x40024000, "rp2040_xosc.ctrl");
	nfail += test_address(&rp2040_xosc.status,				0x40024004, "rp2040_xosc.status");
	nfail += test_address(&rp2040_xosc.dormant,				0x40024008, "rp2040_xosc.dormant");
	nfail += test_address(&rp2040_xosc.startup,				0x4002400c, "rp2040_xosc.startup");
	nfail += test_address(&rp2040_xosc.count,				0x4002401c, "rp2040_xosc.count");

	nfail += test_address(&rp2040_pll.cs,					0x40028000, "rp2040_pll.cs");
	nfail += test_address(&rp2040_pll.pwr,					0x40028004, "rp2040_pll.pwr");
	nfail += test_address(&rp2040_pll.fbdiv_int,			0x40028008, "rp2040_pll.fbdiv_int");
	nfail += test_address(&rp2040_pll.prim,					0x4002800c, "rp2040_pll.prim");

	nfail += test_address(&rp2040_usbpll.cs,				0x4002c000, "rp2040_usbpll.cs");
	nfail += test_address(&rp2040_usbpll.pwr,				0x4002c004, "rp2040_usbpll.pwr");
	nfail += test_address(&rp2040_usbpll.fbdiv_int,			0x4002c008, "rp2040_usbpll.fbdiv_int");
	nfail += test_address(&rp2040_usbpll.prim,				0x4002c00c, "rp2040_usbpll.prim");
	return nfail;
}

static int test_gpio(void)
{
	int nfail = 0;
	nfail += test_address(&rp2040_iobank0.gpio[0].status,	0x40014000, "iobank0.gpio[0].status");
	nfail += test_address(&rp2040_iobank0.gpio[0].ctrl,		0x40014004, "iobank0.gpio[0].ctrl");
	nfail += test_address(&rp2040_iobank0.gpio[1].status,	0x40014008, "iobank0.gpio[1].status");
	nfail += test_address(&rp2040_iobank0.gpio[1].ctrl,		0x4001400c, "iobank0.gpio[1].ctrl");
	nfail += test_address(&rp2040_iobank0.gpio[29].status,	0x400140e8, "iobank0.gpio[29].status");
	nfail += test_address(&rp2040_iobank0.gpio[29].ctrl,	0x400140ec, "iobank0.gpio[29].ctrl");
	nfail += test_address(&rp2040_iobank0.intr[0],			0x400140f0, "iobank0.intr[0]");
	nfail += test_address(&rp2040_iobank0.intr[1],			0x400140f4, "iobank0.intr[1]");
	nfail += test_address(&rp2040_iobank0.intr[2],			0x400140f8, "iobank0.intr[2]");
	nfail += test_address(&rp2040_iobank0.intr[3],			0x400140fc, "iobank0.intr[3]");

	nfail += test_address(&rp2040_iobank0.proc_intctl[0].inte[0],	0x40014100, "iobank0.proc_intctl[0].inte[0]");
	nfail += test_address(&rp2040_iobank0.proc_intctl[0].inte[1],	0x40014104, "iobank0.proc_intctl[0].inte[1]");
	nfail += test_address(&rp2040_iobank0.proc_intctl[0].inte[2],	0x40014108, "iobank0.proc_intctl[0].inte[2]");
	nfail += test_address(&rp2040_iobank0.proc_intctl[0].inte[3],	0x4001410c, "iobank0.proc_intctl[0].inte[3]");
	nfail += test_address(&rp2040_iobank0.proc_intctl[0].intf[0],	0x40014110, "iobank0.proc_intctl[0].intf[0]");
	nfail += test_address(&rp2040_iobank0.proc_intctl[0].intf[1],	0x40014114, "iobank0.proc_intctl[0].intf[1]");
	nfail += test_address(&rp2040_iobank0.proc_intctl[0].intf[2],	0x40014118, "iobank0.proc_intctl[0].intf[2]");
	nfail += test_address(&rp2040_iobank0.proc_intctl[0].intf[3],	0x4001411c, "iobank0.proc_intctl[0].intf[3]");
	nfail += test_address(&rp2040_iobank0.proc_intctl[0].ints[0],	0x40014120, "iobank0.proc_intctl[0].ints[0]");
	nfail += test_address(&rp2040_iobank0.proc_intctl[0].ints[1],	0x40014124, "iobank0.proc_intctl[0].ints[1]");
	nfail += test_address(&rp2040_iobank0.proc_intctl[0].ints[2],	0x40014128, "iobank0.proc_intctl[0].ints[2]");
	nfail += test_address(&rp2040_iobank0.proc_intctl[0].ints[3],	0x4001412c, "iobank0.proc_intctl[0].ints[3]");

	nfail += test_address(&rp2040_iobank0.proc_intctl[1].inte[0],	0x40014130, "iobank0.proc_intctl[1].inte[0]");
	nfail += test_address(&rp2040_iobank0.proc_intctl[1].inte[1],	0x40014134, "iobank0.proc_intctl[1].inte[1]");
	nfail += test_address(&rp2040_iobank0.proc_intctl[1].inte[2],	0x40014138, "iobank0.proc_intctl[1].inte[2]");
	nfail += test_address(&rp2040_iobank0.proc_intctl[1].inte[3],	0x4001413c, "iobank0.proc_intctl[1].inte[3]");
	nfail += test_address(&rp2040_iobank0.proc_intctl[1].intf[0],	0x40014140, "iobank0.proc_intctl[1].intf[0]");
	nfail += test_address(&rp2040_iobank0.proc_intctl[1].intf[1],	0x40014144, "iobank0.proc_intctl[1].intf[1]");
	nfail += test_address(&rp2040_iobank0.proc_intctl[1].intf[2],	0x40014148, "iobank0.proc_intctl[1].intf[2]");
	nfail += test_address(&rp2040_iobank0.proc_intctl[1].intf[3],	0x4001414c, "iobank0.proc_intctl[1].intf[3]");
	nfail += test_address(&rp2040_iobank0.proc_intctl[1].ints[0],	0x40014150, "iobank0.proc_intctl[1].ints[0]");
	nfail += test_address(&rp2040_iobank0.proc_intctl[1].ints[1],	0x40014154, "iobank0.proc_intctl[1].ints[1]");
	nfail += test_address(&rp2040_iobank0.proc_intctl[1].ints[2],	0x40014158, "iobank0.proc_intctl[1].ints[2]");
	nfail += test_address(&rp2040_iobank0.proc_intctl[1].ints[3],	0x4001415c, "iobank0.proc_intctl[1].ints[3]");

	nfail += test_address(&rp2040_iobank0.dormant_wake.inte[0],		0x40014160, "iobank0.dormant_wake.inte[0]");
	nfail += test_address(&rp2040_iobank0.dormant_wake.inte[1],		0x40014164, "iobank0.dormant_wake.inte[1]");
	nfail += test_address(&rp2040_iobank0.dormant_wake.inte[2],		0x40014168, "iobank0.dormant_wake.inte[2]");
	nfail += test_address(&rp2040_iobank0.dormant_wake.inte[3],		0x4001416c, "iobank0.dormant_wake.inte[3]");
	nfail += test_address(&rp2040_iobank0.dormant_wake.intf[0],		0x40014170, "iobank0.dormant_wake.intf[0]");
	nfail += test_address(&rp2040_iobank0.dormant_wake.intf[1],		0x40014174, "iobank0.dormant_wake.intf[1]");
	nfail += test_address(&rp2040_iobank0.dormant_wake.intf[2],		0x40014178, "iobank0.dormant_wake.intf[2]");
	nfail += test_address(&rp2040_iobank0.dormant_wake.intf[3],		0x4001417c, "iobank0.dormant_wake.intf[3]");
	nfail += test_address(&rp2040_iobank0.dormant_wake.ints[0],		0x40014180, "iobank0.dormant_wake.ints[0]");
	nfail += test_address(&rp2040_iobank0.dormant_wake.ints[1],		0x40014184, "iobank0.dormant_wake.ints[1]");
	nfail += test_address(&rp2040_iobank0.dormant_wake.ints[2],		0x40014188, "iobank0.dormant_wake.ints[2]");
	nfail += test_address(&rp2040_iobank0.dormant_wake.ints[3],		0x4001418c, "iobank0.dormant_wake.ints[3]");
	return nfail;
}

static int test_timer(void)
{
	int nfail = 0;
	nfail += test_address(&rp2040_timer.time_hw,		0x40054000, "rp2040_timer.time_hw");
	nfail += test_address(&rp2040_timer.time_lw,		0x40054004, "rp2040_timer.time_lw");
	nfail += test_address(&rp2040_timer.time_hr,		0x40054008, "rp2040_timer.time_hr");
	nfail += test_address(&rp2040_timer.time_lr,		0x4005400c, "rp2040_timer.time_lr");
	nfail += test_address(&rp2040_timer.alarm[0],		0x40054010, "rp2040_timer.alarm[0]");
	nfail += test_address(&rp2040_timer.alarm[1],		0x40054014, "rp2040_timer.alarm[1]");
	nfail += test_address(&rp2040_timer.alarm[2],		0x40054018, "rp2040_timer.alarm[2]");
	nfail += test_address(&rp2040_timer.alarm[3],		0x4005401c, "rp2040_timer.alarm[3]");
	nfail += test_address(&rp2040_timer.armed,			0x40054020, "rp2040_timer.armed");
	nfail += test_address(&rp2040_timer.time_hraw,		0x40054024, "rp2040_timer.time_hraw");
	nfail += test_address(&rp2040_timer.time_lraw,		0x40054028, "rp2040_timer.time_lraw");
	nfail += test_address(&rp2040_timer.dbgpause,		0x4005402c, "rp2040_timer.dbgpause");
	nfail += test_address(&rp2040_timer.pause,			0x40054030, "rp2040_timer.dbgpause");
	nfail += test_address(&rp2040_timer.intcs.intr,		0x40054034, "rp2040_timer.intcs.intr");
	nfail += test_address(&rp2040_timer.intcs.inte,		0x40054038, "rp2040_timer.intcs.inte");
	nfail += test_address(&rp2040_timer.intcs.intf,		0x4005403c, "rp2040_timer.intcs.intf");
	nfail += test_address(&rp2040_timer.intcs.ints,		0x40054040, "rp2040_timer.intcs.ints");
	return nfail;
}

