TheLancashireman/rp2040-bare-metal/test/compile-test/header-test.c
static int test_uart(void)
{
	int nfail = 0;
	nfail += test_address(&rp2040_uart0.dr,				0x40034000, "rp2040_uart0.dr");
	nfail += test_address(&rp2040_uart0.rsr,			0x40034004, "rp2040_uart0.rsr");
	nfail += test_address(&rp2040_uart0.fr,				0x40034018, "rp2040_uart0.fr");
	nfail += test_address(&rp2040_uart0.ilpr,			0x40034020, "rp2040_uart0.ilpr");
	nfail += test_address(&rp2040_uart0.ibrd,			0x40034024, "rp2040_uart0.ibrd");
	nfail += test_address(&rp2040_uart0.fbrd,			0x40034028, "rp2040_uart0.fbrd");
	nfail += test_address(&rp2040_uart0.lcr_h,			0x4003402c, "rp2040_uart0.lcr_h");
	nfail += test_address(&rp2040_uart0.cr,				0x40034030, "rp2040_uart0.cr");
	nfail += test_address(&rp2040_uart0.ifls,			0x40034034, "rp2040_uart0.ifls");
	nfail += test_address(&rp2040_uart0.imsc,			0x40034038, "rp2040_uart0.imsc");
	nfail += test_address(&rp2040_uart0.ris,			0x4003403c, "rp2040_uart0.ris");
	nfail += test_address(&rp2040_uart0.mis,			0x40034040, "rp2040_uart0.mis");
	nfail += test_address(&rp2040_uart0.icr,			0x40034044, "rp2040_uart0.icr");
	nfail += test_address(&rp2040_uart0.dmacr,			0x40034048, "rp2040_uart0.dmacr");

	nfail += test_address(&rp2040_uart0.id[0],			0x40034fe0, "rp2040_uart0.id[0]");
	nfail += test_address(&rp2040_uart0.id[1],			0x40034fe4, "rp2040_uart0.id[1]");
	nfail += test_address(&rp2040_uart0.id[2],			0x40034fe8, "rp2040_uart0.id[2]");
	nfail += test_address(&rp2040_uart0.id[3],			0x40034fec, "rp2040_uart0.id[3]");
	nfail += test_address(&rp2040_uart0.cellid[0],		0x40034ff0, "rp2040_uart0.cellid[0]");
	nfail += test_address(&rp2040_uart0.cellid[1],		0x40034ff4, "rp2040_uart0.cellid[1]");
	nfail += test_address(&rp2040_uart0.cellid[2],		0x40034ff8, "rp2040_uart0.cellid[2]");
	nfail += test_address(&rp2040_uart0.cellid[3],		0x40034ffc, "rp2040_uart0.cellid[3]");

	nfail += test_address(&rp2040_uart1.dr,				0x40038000, "rp2040_uart1.dr");
	nfail += test_address(&rp2040_uart1.rsr,			0x40038004, "rp2040_uart1.rsr");
	nfail += test_address(&rp2040_uart1.fr,				0x40038018, "rp2040_uart1.fr");
	nfail += test_address(&rp2040_uart1.ilpr,			0x40038020, "rp2040_uart1.ilpr");
	nfail += test_address(&rp2040_uart1.ibrd,			0x40038024, "rp2040_uart1.ibrd");
	nfail += test_address(&rp2040_uart1.fbrd,			0x40038028, "rp2040_uart1.fbrd");
	nfail += test_address(&rp2040_uart1.lcr_h,			0x4003802c, "rp2040_uart1.lcr_h");
	nfail += test_address(&rp2040_uart1.cr,				0x40038030, "rp2040_uart1.cr");
	nfail += test_address(&rp2040_uart1.ifls,			0x40038034, "rp2040_uart1.ifls");
	nfail += test_address(&rp2040_uart1.imsc,			0x40038038, "rp2040_uart1.imsc");
	nfail += test_address(&rp2040_uart1.ris,			0x4003803c, "rp2040_uart1.ris");
	nfail += test_address(&rp2040_uart1.mis,			0x40038040, "rp2040_uart1.mis");
	nfail += test_address(&rp2040_uart1.icr,			0x40038044, "rp2040_uart1.icr");
	nfail += test_address(&rp2040_uart1.dmacr,			0x40038048, "rp2040_uart1.dmacr");

	nfail += test_address(&rp2040_uart1.id[0],			0x40038fe0, "rp2040_uart1.id[0]");
	nfail += test_address(&rp2040_uart1.id[1],			0x40038fe4, "rp2040_uart1.id[1]");
	nfail += test_address(&rp2040_uart1.id[2],			0x40038fe8, "rp2040_uart1.id[2]");
	nfail += test_address(&rp2040_uart1.id[3],			0x40038fec, "rp2040_uart1.id[3]");
	nfail += test_address(&rp2040_uart1.cellid[0],		0x40038ff0, "rp2040_uart1.cellid[0]");
	nfail += test_address(&rp2040_uart1.cellid[1],		0x40038ff4, "rp2040_uart1.cellid[1]");
	nfail += test_address(&rp2040_uart1.cellid[2],		0x40038ff8, "rp2040_uart1.cellid[2]");
	nfail += test_address(&rp2040_uart1.cellid[3],		0x40038ffc, "rp2040_uart1.cellid[3]");
	return nfail;
}

#if 0
/* Template peripheral test
*/
static int test_per(void)
{
	int nfail = 0;
	nfail += test_address(&rp2040_xxx.rr,			0xdeadbeef, "rp2040_xxx.rr");
	return nfail;
}
#endif


static int test_address(volatile void *p, u32_t v, char *name)
{
	u32_t addr = (u32_t)(u64_t)p;
	if ( addr == v )
		return 0;

	printf("%s has wrong address 0x%08x\n", name, addr);
	return 1;
}

